// Package uknational provides Ukrainian romanization converter,
// as defined in http://zakon.rada.gov.ua/laws/show/55-2010-%D0%BF
//
// TODO: letter position handling - this is impossible to do 100% correctly with current Converter implementation.
package uknational

import "github.com/mxmCherry/translit"

// Converter returns Ukrainian romanization converter,
// as defined in http://zakon.rada.gov.ua/laws/show/55-2010-%D0%BF
//
// TODO: letter position handling - this is impossible to do 100% correctly with current Converter implementation.
func Converter() translit.Converter {
	return converter
}

var converter = translit.New(
	map[string]string{
		"А": "A",
		"a": "a",

		"Б": "B",
		"б": "b",

		"В": "V",
		"в": "v",

		"Г": "H",
		"г": "h",

		"Ґ": "G",
		"ґ": "g",

		"Д": "D",
		"д": "d",

		"Е": "E",
		"е": "e",

		// poor man's position handling:
		"Є": "Ye", // на початку слова
		"є": "ie", // в інших позиціях

		"Ж": "Zh",
		"ж": "zh",

		"З": "Z",
		"з": "z",

		"И": "Y",
		"и": "y",

		"І": "I",
		"і": "i",

		// poor man's position handling:
		"Ї": "Yi", // на початку слова
		"ї": "i",  // в інших позиціях

		// poor man's position handling:
		"Й": "Y", // на початку слова
		"й": "i", // в інших позиціях

		"К": "K",
		"к": "k",

		"Л": "L",
		"л": "l",

		"М": "M",
		"м": "m",

		"Н": "N",
		"н": "n",

		"О": "O",
		"о": "o",

		"П": "P",
		"п": "p",

		"Р": "R",
		"р": "r",

		"С": "S",
		"с": "s",

		"Т": "T",
		"т": "t",

		"У": "U",
		"у": "u",

		"Ф": "F",
		"ф": "f",

		"Х": "Kh",
		"х": "kh",

		"Ц": "Ts",
		"ц": "ts",

		"Ч": "Ch",
		"ч": "ch",

		"Ш": "Sh",
		"ш": "sh",

		"Щ": "Shch",
		"щ": "shch",

		// poor man's position handling:
		"Ю": "Yu", // на початку слова
		"ю": "iu", // в інших позиціях

		// poor man's position handling:
		"Я": "Ya", // на початку слова
		"я": "ia", // в інших позиціях

		// 1. Буквосполучення "зг" відтворюється латиницею як "zgh"
		// (наприклад,  Згорани - Zghorany, Розгон - Rozghon) на
		// відміну від "zh" - відповідника української літери
		// "ж".
		"Зг": "Zgh",
		"ЗГ": "ZGH", // all-upper-case handling
		"зг": "zgh",
	},
)

/*

http://zakon.rada.gov.ua/laws/show/55-2010-%D0%BF

------------------------------------------------------------------
| Український | Латиниця |  Позиція у |    Приклади написання    |
|   алфавіт   |          |   слові    |--------------------------|
|             |          |            |українською |  латиницею  |
|             |          |            |    мовою   |             |
|-------------+----------+------------+------------+-------------|
|      Аa     |    Aа    |            |Алушта      |Alushta      |
|             |          |            |Андрій      |Andrii       |
|-------------+----------+------------+------------+-------------|
|      Бб     |    Bb    |            |Борщагівка  |Borshchahivka|
|             |          |            |Борисенко   |Borysenko    |
|-------------+----------+------------+------------+-------------|
|      Вв     |    Vv    |            |Вінниця     |Vinnytsia    |
|             |          |            |Володимир   |Volodymyr    |
|-------------+----------+------------+------------+-------------|
|      Гг     |    Hh    |            |Гадяч       |Hadiach      |
|             |          |            |Богдан      |Bohdan       |
|             |          |            |Згурський   |Zghurskyi    |
|-------------+----------+------------+------------+-------------|
|      Ґґ     |    Gg    |            |Ґалаґан     |Galagan      |
|             |          |            |Ґорґани     |Gorgany      |
|-------------+----------+------------+------------+-------------|
|      Дд     |    Dd    |            |Донецьк     |Donetsk      |
|             |          |            |Дмитро      |Dmytro       |
|-------------+----------+------------+------------+-------------|
|      Ее     |    Ee    |            |Рівне       |Rivne        |
|             |          |            |Олег        |Oleh         |
|             |          |            |Есмань      |Esman        |
|-------------+----------+------------+------------+-------------|
|      Єє     |    Ye    | на початку |Єнакієве    |Yenakiieve   |
|             |          |    слова   |Гаєвич      |Haievych     |
|             |    ie    |  в інших   |Короп'є     |Koropie      |
|             |          |  позиціях  |            |             |
|-------------+----------+------------+------------+-------------|
|      Жж     |  Zh zh   |            |Житомир     |Zhytomyr     |
|             |          |            |Жанна       |Zhanna       |
|             |          |            |Жежелів     |Zhezheliv    |
|-------------+----------+------------+------------+-------------|
|      Зз     |    Zz    |            |Закарпаття  |Zakarpattia  |
|             |          |            |Казимирчук  |Kazymyrchuk  |
|-------------+----------+------------+------------+-------------|
|      Ии     |    Yy    |            |Медвин      |Medvyn       |
|             |          |            |Михайленко  |Mykhailenko  |
|-------------+----------+------------+------------+-------------|
|      Іі     |    Ii    |            |Іванків     |Ivankiv      |
|             |          |            |Іващенко    |Ivashchenko  |
|-------------+----------+------------+------------+-------------|
|      Її     |    Yi    | на початку |Їжакевич    |Yizhakevych  |
|             |          |    слова   |Кадиївка    |Kadyivka     |
|             |     i    |  в інших   |Мар'їне     |Marine       |
|             |          |  позиціях  |            |             |
|-------------+----------+------------+------------+-------------|
|      Йй     |    Y     | на початку |Йосипівка   |Yosypivka    |
|             |          |    слова   |Стрий       |Stryi        |
|             |    i     |  в інших   |Олексій     |Oleksii      |
|             |          |  позиціях  |            |             |
|-------------+----------+------------+------------+-------------|
|      Кк     |    Kk    |            |Київ        |Kyiv         |
|             |          |            |Коваленко   |Kovalenko    |
|-------------+----------+------------+------------+-------------|
|      Лл     |    Ll    |            |Лебедин     |Lebedyn      |
|             |          |            |Леонід      |Leonid       |
|-------------+----------+------------+------------+-------------|
|      Мм     |    Mm    |            |Миколаїв    |Mykolaiv     |
|             |          |            |Маринич     |Marynych     |
|-------------+----------+------------+------------+-------------|
|      Нн     |    Nn    |            |Ніжин       |Nizhyn       |
|             |          |            |Наталія     |Nataliia     |
|-------------+----------+------------+------------+-------------|
|      Оо     |    Oo    |            |Одеса       |Odesa        |
|             |          |            |Онищенко    |Onyshchenko  |
|-------------+----------+------------+------------+-------------|
|      Пп     |    Pp    |            |Полтава     |Poltava      |
|             |          |            |Петро       |Petro        |
|-------------+----------+------------+------------+-------------|
|      Рр     |    Rr    |            |Решетилівка |Reshetylivka |
|             |          |            |Рибчинський |Rybchynskyi  |
|-------------+----------+------------+------------+-------------|
|      Сс     |    Ss    |            |Суми        |Sumy         |
|             |          |            |Соломія     |Solomiia     |
|-------------+----------+------------+------------+-------------|
|      Тт     |    Tt    |            |Тернопіль   |Ternopil     |
|             |          |            |Троць       |Trots        |
|-------------+----------+------------+------------+-------------|
|      Уу     |    Uu    |            |Ужгород     |Uzhhorod     |
|             |          |            |Уляна       |Uliana       |
|-------------+----------+------------+------------+-------------|
|      Фф     |    Ff    |            |Фастів      |Fastiv       |
|             |          |            |Філіпчук    |Filipchuk    |
|-------------+----------+------------+------------+-------------|
|      Хх     |  Kh kh   |            |Харків      |Kharkiv      |
|             |          |            |Христина    |Khrystyna    |
|-------------+----------+------------+------------+-------------|
|      Цц     |  Ts ts   |            |Біла Церква |Bila Tserkva |
|             |          |            |Стеценко    |Stetsenko    |
|-------------+----------+------------+------------+-------------|
|      Чч     |  Ch ch   |            |Чернівці    |Chernivtsi   |
|             |          |            |Шевченко    |Shevchenko   |
|-------------+----------+------------+------------+-------------|
|      Шш     |  Sh sh   |            |Шостка      |Shostka      |
|             |          |            |Кишеньки    |Kyshenky     |
|-------------+----------+------------+------------+-------------|
|      Щщ     |Shch shch |            |Щербухи     |Shcherbukhy  |
|             |          |            |Гоща        |Hoshcha      |
|             |          |            |Гаращенко   |Harashchenko |
|-------------+----------+------------+------------+-------------|
|      Юю     |    Yu    | на початку |Юрій        |Yurii        |
|             |          |    слова   |Корюківка   |Koriukivka   |
|             |    iu    |  в інших   |            |             |
|             |          |  позиціях  |            |             |
|-------------+----------+------------+------------+-------------|
|      Яя     |    Ya    | на початку |Яготин      |Yahotyn      |
|             |          |    слова   |Ярошенко    |Yaroshenko   |
|             |    ia    |  в інших   |Костянтин   |Kostiantyn   |
|             |          |  позиціях  |Знам'янка   |Znamianka    |
|             |          |            |Феодосія    |Feodosiia    |
------------------------------------------------------------------

Примітки:

1. Буквосполучення "зг" відтворюється латиницею як "zgh"
(наприклад,  Згорани - Zghorany, Розгон - Rozghon) на
відміну від "zh" - відповідника української літери
"ж".

2. М'який знак і апостроф латиницею не відтворюються.

3. Транслітерація прізвищ та імен осіб і географічних
назв здійснюється шляхом відтворення кожної літери
латиницею.

*/
